placeholder/0_52_3-00640_9/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (0 1.5 0)
    (0 1 0)
    (0 0.48 0)
    (0 0 0)
    (0.2 1.5 0)
    (0.2 1 0)
    (0.2 0.48 0)
    (0.2 0 0)
    (1.475 1 0)
    (1.475 0.48 0)
    (1.475 0 0)
    (1.525 1 0)
    (1.525 0.48 0)
    (1.525 0 0)
    (2.8 1.5 0)
    (2.8 1 0)
    (2.8 0.48 0)
    (2.8 0 0)
    (3 1.5 0)
    (3 1 0)
    (3 0.48 0)
    (3 0 0)
    (0 1.5 -0.01)
    (0 1 -0.01)
    (0 0.48 -0.01)
    (0 0 -0.01)
    (0.2 1.5 -0.01)
    (0.2 1 -0.01)
    (0.2 0.48 -0.01)
    (0.2 0 -0.01)
    (1.475 1 -0.01)
    (1.475 0.48 -0.01)
    (1.475 0 -0.01)
    (1.525 1 -0.01)
    (1.525 0.48 -0.01)
    (1.525 0 -0.01)
    (2.8 1.5 -0.01)
    (2.8 1 -0.01)
    (2.8 0.48 -0.01)
    (2.8 0 -0.01)
    (3 1.5 -0.01)
    (3 1 -0.01)
    (3 0.48 -0.01)
    (3 0 -0.01)
);
blocks
( 
    hex (1 0 4 5 23 22 26 27) (20 10 1) simpleGrading (1 1 1)
    hex (2 1 5 6 24 23 27 28) (21 10 1) simpleGrading (1 1 1)
    hex (3 2 6 7 25 24 28 29) (19 10 1) simpleGrading (1 1 1)
    hex (6 5 8 9 28 27 30 31) (21 60 1) simpleGrading (1 1 1)
    hex (7 6 9 10 29 28 31 32) (19 60 1) simpleGrading (1 1 1)
    hex (10 9 12 13 32 31 34 35) (19 3 1) simpleGrading (1 1 1)
    hex (12 11 15 16 34 33 37 38) (21 60 1) simpleGrading (1 1 1)
    hex (13 12 16 17 35 34 38 39) (19 60 1) simpleGrading (1 1 1)
    hex (15 14 18 19 37 36 40 41) (20 10 1) simpleGrading (1 1 1)
    hex (16 15 19 20 38 37 41 42) (21 10 1) simpleGrading (1 1 1)
    hex (17 16 20 21 39 38 42 43) (19 10 1) simpleGrading (1 1 1)
);
edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (22 0 4 26)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (14 18 40 36)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (1 0 22 23)
            (2 1 23 24)
            (3 2 24 25)
            (3 25 29 7)
            (7 29 32 10)
            (10 32 35 13)
            (13 35 39 17)
            (17 39 43 21)
            (42 20 21 43)
            (19 20 42 41)
            (18 19 41 40)
            (14 36 37 15)
            (11 15 37 33)
            (5 8 30 27)
            (4 5 27 26) 
        );
    }
    baffle
    {
        type wall;
        faces
        (
            (12 11 33 34)
            (12 34 31 9)
            (8 9 31 30)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (5 4 0 1)
            (6 5 1 2)
            (7 6 2 3)
            (9 8 5 6)
(10 9 6 7)
            (13 12 9 10)
            (16 15 11 12)
            (17 16 12 13)
(19 18 14 15)
            (20 19 15 16)
            (21 20 16 17)
            (23 22 26 27)
            (24 23 27 28)
            (25 24 28 29)
            (28 27 30 31)
            (29 28 31 32)
            (32 31 34 35)
            (34 33 37 38)
            (35 34 38 39)
            (37 36 40 41)
            (38 37 41 42)
            (39 38 42 43)
        );
   }
);

mergePatchPairs
(
);

// ************************************************************************* //
